//*****************************************************************************
//* @file   GameObject.h
//* @brief  ゲームオブジェクトクラス
//* @note   ゲームで使用するオブジェクトクラス
//* 
//* @author YadoumaruRyusei
//* @date   July 2022
//*****************************************************************************
#include "GameObject.h"


//==============================================================================
//!	@fn		InstanceProcess
//!	@brief	生成時の初期化プロセス
//==============================================================================
void GAME_SYSTEMS::GameObject::InstanceProcess() noexcept
{
	OnEnable();
	Start();
}


//==============================================================================
//!	@fn		Process
//!	@brief	更新中のプロセス
//==============================================================================
void GAME_SYSTEMS::GameObject::Process() noexcept
{
	Update();
	//if (Timer::GetIsFixed() == true) FixedUpdate();
}


//==============================================================================
//!	@fn		DestroyProcess
//!	@brief	破壊時の終了プロセス
//==============================================================================
void GAME_SYSTEMS::GameObject::DestroyProcess() noexcept
{
	End();
	OnDisable();
	m_componentList.clear();
}