//*****************************************************************************
//* @file   Scene.cpp
//* @brief  シーンのベースクラス
//* @note   全てのシーンのもととなる。シーンを生成するときはここから生成する
//* 
//* @author YadoumaruRyusei
//* @date   July 2022
//*****************************************************************************

#include "Scene.h"

/**============================================================================
//! @func   Initialize
//! @brief  初期化
//! @retval true:正常終了　false:異常終了
============================================================================*/
bool GAME_SYSTEMS::Scene::Initialize()
{
	//シーンのセットアップ
	SceneSetUp();

	//オブジェクトエントリー
	ObjectEntry();

	//シーン初期設定
	BeginPlay();

	return true;
}


/**============================================================================
//! @func   Run
//! @brief  シーン更新
//! @retval true:正常終了　false:異常終了
============================================================================*/
bool GAME_SYSTEMS::Scene::Run()
{
	Tick();
	return true;
}


/**============================================================================
//! @func   Finalize
//! @brief  終了処理
//! @retval true:正常終了　false:異常終了
============================================================================*/
bool GAME_SYSTEMS::Scene::Finalize()
{
	EndPlay();
	SceneShutdown();
	return true;
}


/**============================================================================
//! @func   SceneSetUp
//! @brief  通用的なシーンの初期化処理を行う
//! @retval true:正常終了　false:異常終了
============================================================================*/
bool GAME_SYSTEMS::Scene::SceneSetUp()
{
	m_displayColor = myMath::Color::Black;
	return true;
}


/**============================================================================
//! @func   SceneShutdown
//! @brief  通用的なシーンの終了処理を行う
//! @retval true:正常終了　false:異常終了
============================================================================*/
bool GAME_SYSTEMS::Scene::SceneShutdown()
{
	return true;
}