//******************************************************************************
//* @file   SystemTimer.cpp
//* @brief  システムタイマークラス
//* @note   システム上の時間を管理する
//* 
//* @author YadoumaruRyusei
//* @date   August 2022
//*****************************************************************************

#include "SystemTimer.h"

//==============================================================================
//!	@fn		SetUp
//!	@brief	初期化処理
//!	@note	シングルトンクラスの初期化を明示的に行う
//!	@retval	TRUE　成功終了/FALSE　失敗終了
//==============================================================================
bool systems::SystemTimer::SetUp()
{
	//タイマー解像度設定
	::timeBeginPeriod(1);

	return true;
}


//==============================================================================
//!	@fn		ShutDown
//!	@brief	終了処理
//!	@note	シングルトンクラスの終了を明示的に行う
//!	@retval	TRUE　成功終了/FALSE　失敗終了
//==============================================================================
bool systems::SystemTimer::ShutDown()
{
	::timeEndPeriod(1);
	return true;
}
